aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_s12ad_rx/src/targets/rx66t/r_s12ad_rx66t.c
    /* NOTE: S12CMPBI interrupts are level-based, not edge, so there will be
     * continuous triggers while condition is met. Writing 0 to the flags has
     * no effect UNTIL the condition clears.
     *
     * Also, the data register for the channel/sensor will still be written to.
     * The S12CMPBI interrupt does not replace it but is in addition to it.
     */

    /* Get S12AD register address */
    p_regs = ADC_PRV_GET_REGS_PTR(unit);

    /* Cast to match variable type */
    flags = (uint32_t)p_regs->ADCMPBSR.BIT.CMPSTB;
    p_regs->ADCMPBSR.BIT.CMPSTB = 0;
    if (0 == p_regs->ADCMPBSR.BIT.CMPSTB)
    {
        R_BSP_NOP();
    }

    return flags;
} /* End of function adc_get_and_clr_cmpi_flagsb() */


/******************************************************************************
* Function Name: adc_configure_scan
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode. Mask registers are
*                initialized and interrupts enabled in peripheral. Interrupts
*                are also enabled in ICU if corresponding priority is not 0.
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
static adc_err_t adc_configure_scan(uint8_t const   unit,
                                    adc_ch_cfg_t   *p_config)
{

    /* Get S12AD register address */
    aregs_t     *p_regs = ADC_PRV_GET_REGS_PTR(unit);
    uint32_t  i;
    volatile uint32_t  tmp_mask=0;
    volatile uint16_t  trig_a;
    volatile uint16_t  trig_b;
    volatile uint16_t  trig_c;
    volatile uint16_t  tmp_adpgadcr0[ADC_PGA_CHANNEL_MAX];
    volatile uint16_t  tmp_adpgags0[ADC_PGA_CHANNEL_MAX];
    volatile uint16_t  tmp_adpgacr[ADC_PGA_CHANNEL_MAX];
    volatile uint8_t   tmp_adscs[ADC_2_REG_ARRAY_MAX];
    volatile uint32_t  conv_order_cnt;
    volatile uint32_t  bit_cnt;
    volatile uint32_t  tmp_adansa;
    volatile uint32_t  tmp_adansa_invert;
    uint16_t  tmp_adpgadcr0_regs;
    uint16_t  tmp_adpgags0_regs;
    uint16_t  tmp_adpgacr_regs;

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    err = adc_check_scan_config(unit, p_config);
    if (ADC_SUCCESS != err)
    {
        return err;
    }

#endif /* parameter checking */

    /* SET MASKS FOR CHANNELS AND SENSORS */

    /* Cast to match the register type */
    p_regs->ADANSA0.WORD = (uint16_t) (p_config->chan_mask & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADANSB0.WORD = (uint16_t) (p_config->chan_mask_groupb & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADANSC0.WORD = (uint16_t) (p_config->chan_mask_groupc & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADADS0.WORD = (uint16_t) (p_config->add_mask & 0x0FFF);

    if (2 == unit)
    {

        /* Cast to match the register type */
        S12AD2.ADANSA1.WORD = (uint16_t) ((p_config->chan_mask >> 16) & 0x0003);

        /* Cast to match the register type */
        S12AD2.ADANSB1.WORD = (uint16_t) ((p_config->chan_mask_groupb >> 16) & 0x0003);

        /* Cast to match the register type */
        S12AD2.ADANSC1.WORD = (uint16_t) ((p_config->chan_mask_groupc >> 16) & 0x0003);

        /* Cast to match the register type */
        S12AD2.ADADS1.WORD = (uint16_t) ((p_config->add_mask >> 16) & 0x0003);

        adc_configure_sensors(p_config);
    }

    /* SET ORDER OF CHANNEL CONVERSION */
    tmp_adansa = 0;
    tmp_adansa |= (p_config->chan_mask & 0x00030FFF);
    tmp_adansa |= (p_config->chan_mask_groupb & 0x00030FFF);
    tmp_adansa |= (p_config->chan_mask_groupc & 0x00030FFF);
    tmp_adansa_invert = ((~tmp_adansa) & 0x00030FFF);

    bit_cnt = 0;
    conv_order_cnt = 0;

    /* WAIT_LOOP */
    for (i= 0x00000001; i<0x00040000; i<<=1)
    {
        if (0 != (tmp_adansa & i))
        {
            bit_cnt++;
        }
    }

    /* WAIT_LOOP */
    for (i=bit_cnt; i<ADC_2_REG_ARRAY_MAX; i++)
    {

        /* WAIT_LOOP */
        while (conv_order_cnt<32)
        {
            if (1 == (tmp_adansa_invert & 0x00000001))
            {
                tmp_adscs[i] = conv_order_cnt;
                tmp_adansa_invert >>= 1;
                conv_order_cnt++;
                break;
            }

            tmp_adansa_invert >>= 1;
            conv_order_cnt++;
        }
    }

    conv_order_cnt = 0;

    if (ADC_CONV_ORDER_MANUAL_SETTING == p_config->conv_order_status)
    {

        /* WAIT_LOOP */
        for (i=0; i<bit_cnt; i++)
        {
            tmp_adscs[i] = 0;
            conv_order_cnt = p_config->conversion_order[i];

            /* WAIT_LOOP */
            while (conv_order_cnt > 1)
            {
                tmp_adscs[i]++;
                conv_order_cnt >>= 1;
            }
        }
    }
    else
    {

        /* WAIT_LOOP */
        for (i=0; i<bit_cnt; i++)
        {

            /* WAIT_LOOP */
            while (conv_order_cnt<32)
            {
                if (1 == (tmp_adansa & 0x00000001))
                {
                    tmp_adscs[i] = conv_order_cnt;
                    tmp_adansa >>= 1;
                    conv_order_cnt++;
                    break;
                }

                tmp_adansa >>= 1;
                conv_order_cnt++;
            }
        }
    }

    /* Set ADSCSn Register */
    p_regs->ADSCS0 = tmp_adscs[0];
    p_regs->ADSCS1 = tmp_adscs[1];
    p_regs->ADSCS2 = tmp_adscs[2];
    p_regs->ADSCS3 = tmp_adscs[3];
    p_regs->ADSCS4 = tmp_adscs[4];
    p_regs->ADSCS5 = tmp_adscs[5];
    p_regs->ADSCS6 = tmp_adscs[6];
    p_regs->ADSCS7 = tmp_adscs[7];

    if (2 == unit)
    {
        p_regs->ADSCS8  = tmp_adscs[8];
        p_regs->ADSCS9  = tmp_adscs[9];
        p_regs->ADSCS10 = tmp_adscs[10];
        p_regs->ADSCS11 = tmp_adscs[11];
        p_regs->ADSCS12 = tmp_adscs[12];
        p_regs->ADSCS13 = tmp_adscs[13];
    }

    /* NOTE: S&H adds to scan time because normal state machine still runs. */
    /* adds 12 + sample_hold_states ADCLKS to scan time */
    if (0 == unit)
    {
        S12AD.ADSHCR.BIT.SHANS = p_config->sample_hold_mask;
        S12AD.ADSHCR.BIT.SSTSH = p_config->sample_hold_states;
    }
    else if (1 == unit)
    {
        S12AD1.ADSHCR.BIT.SHANS = p_config->sample_hold_mask;
        S12AD1.ADSHCR.BIT.SSTSH = p_config->sample_hold_states;
    }

    /* SET PROGRAMMABLE GAIN AMPLIFIER */
    if ((0 == unit) || (1 == unit))
    {

        /* WAIT_LOOP */
        for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
        {
            tmp_adpgadcr0[i] = 0x0000;
            tmp_adpgags0[i] = 0x0000;
            tmp_adpgacr[i] = 0x0000;

            /* Set ADPGACR.PxCR */
            switch (p_config->signal_path_control[i])
            {
                case ADC_ANALOG_INPUT_1:
                    tmp_adpgacr[i] = 0x0001;
                    break;

