aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_s12ad_rx/src/targets/rx66t/r_s12ad_rx66t.c
                case ADC_ANALOG_INPUT_2:
                    tmp_adpgacr[i] = 0x0008;
                    break;

                case ADC_ANALOG_INPUT_3:
                    tmp_adpgacr[i] = 0x0009;
                    break;

                case ADC_PGA_SINGLE_END_INPUT_1:
                case ADC_PGA_DIFFERENTIAL_INPUT_1:
                    tmp_adpgacr[i] = 0x000C;
                    break;

                case ADC_PGA_SINGLE_END_INPUT_2:
                case ADC_PGA_DIFFERENTIAL_INPUT_2:
                    tmp_adpgacr[i] = 0x000D;
                    break;

                case ADC_PGA_SINGLE_END_INPUT_3:
                case ADC_PGA_DIFFERENTIAL_INPUT_3:
                    tmp_adpgacr[i] = 0x000E;
                    break;

                case ADC_GENERAL_PORT_1:
                default:
                    tmp_adpgacr[i] = 0x0000;
                    break;
            }

            /* Set ADPGAGS0.PxGAIN */
            tmp_adpgags0[i] = (uint16_t) (p_config->pga_gain[i] & 0x000F);

            /* Set ADPGADCR0.PxDG and ADPGADCR0.PxDEN */
            switch (p_config->pga_gain[i])
            {

                /* PGA_DIFFERENTIAL_INPUT */
                case ADC_PGA_GAIN_1_500_DIFF:
                    tmp_adpgadcr0[i] = 0x0008;
                    break;

                case ADC_PGA_GAIN_4_000_DIFF:
                    tmp_adpgadcr0[i] = 0x0009;
                    break;

                case ADC_PGA_GAIN_7_000_DIFF:
                    tmp_adpgadcr0[i] = 0x000A;
                    break;

                case ADC_PGA_GAIN_12_333_DIFF:
                    tmp_adpgadcr0[i] = 0x000B;
                    break;

                /* ADC_PGA_OFF or ADC_PGA_SINGLE_ENDED */
                default:
                    tmp_adpgadcr0[i] = 0x0000;
                    break;
            }
        }

        /* Set PGA Register */
        tmp_adpgadcr0_regs = 0x8000;
        tmp_adpgadcr0_regs |= (tmp_adpgadcr0[2]<<8);
        tmp_adpgadcr0_regs |= (tmp_adpgadcr0[1]<<4);
        tmp_adpgadcr0_regs |= tmp_adpgadcr0[0];

        tmp_adpgags0_regs = (tmp_adpgags0[2]<<8);
        tmp_adpgags0_regs |= (tmp_adpgags0[1]<<4);
        tmp_adpgags0_regs |= tmp_adpgags0[0];

        tmp_adpgacr_regs = (tmp_adpgacr[2]<<8);
        tmp_adpgacr_regs |= (tmp_adpgacr[1]<<4);
        tmp_adpgacr_regs |= tmp_adpgacr[0];
        
        if (0 == unit)
        {
            S12AD.ADPGADCR0.WORD = (0x8FFF & tmp_adpgadcr0_regs);
            S12AD.ADPGAGS0.WORD = (0x0FFF & tmp_adpgags0_regs);
            S12AD.ADPGACR.WORD = (0x0FFF & tmp_adpgacr_regs);
        }
        else if (1 == unit)
        {
            S12AD1.ADPGADCR0.WORD = (0x8FFF & tmp_adpgadcr0_regs);
            S12AD1.ADPGAGS0.WORD = (0x0FFF & tmp_adpgags0_regs);
            S12AD1.ADPGACR.WORD = (0x0FFF & tmp_adpgacr_regs);
        }

        /* Waiting time for PGA stabilization.
           Stabilization time * margin = 5us * 1.1 = 5.5us */
        R_BSP_SoftwareDelay(6, BSP_DELAY_MICROSECS);
    }

    /* SET GROUP A PRIORITY ACTION (not interrupt priority!) */
    if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
    {
        trig_a = p_regs->ADSTRGR.BIT.TRSA;              // save TRSA
        trig_b = p_regs->ADSTRGR.BIT.TRSB;              // save TRSB
        trig_c = p_regs->ADGCTRGR.BIT.TRSC;             // save TRSC
        p_regs->ADSTRGR.BIT.TRSA = ADC_TRIG_NONE;
        p_regs->ADSTRGR.BIT.TRSB = ADC_TRIG_NONE;
        p_regs->ADGCTRGR.BIT.TRSC = ADC_TRIG_NONE;
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSA)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSB)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADGCTRGR.BIT.TRSC) // bus wait for ADGCTRGR write
        {
            R_BSP_NOP();
        }

        p_regs->ADGSPCR.WORD = p_config->priority_groupa;

        p_regs->ADSTRGR.BIT.TRSA = trig_a;           // restore TRSA

        if (0 == p_regs->ADGSPCR.BIT.GBRP)
        {
            p_regs->ADSTRGR.BIT.TRSB = trig_b;   // restore TRSB
            p_regs->ADGCTRGR.BIT.TRSC = trig_c;  // restore TRSC
        }
        else
        {
            if (0 == p_regs->ADGCTRGR.BIT.GRCE)
            {
                p_regs->ADGCTRGR.BIT.TRSC = trig_c;  // restore TRSC
            }
            else
            {
                p_regs->ADSTRGR.BIT.TRSB = trig_b;   // restore TRSB
            }
        }
    }
    else
    {
        p_regs->ADGSPCR.WORD = p_config->priority_groupa;
    }

    /* SET SELF DIAGNOSIS REGISTERS (VIRTUAL CHANNEL) */
    if (ADC_DIAG_OFF == p_config->diag_method)
    {
        p_regs->ADCER.BIT.DIAGM = 0;
    }
    else
    {

        /* NOTE: Using Self Diagnosis adds 11/13/15(resolution) + (ch0 SST) ADCLKS to scan time. */
        /* (ch0 can still be used with self diagnosis on) */
        if (ADC_DIAG_ROTATE_VOLTS == p_config->diag_method)
        {
            p_regs->ADCER.BIT.DIAGLD = 0;
            p_regs->ADCER.BIT.DIAGVAL = 1;
        }
        else
        {
            p_regs->ADCER.BIT.DIAGLD = 1;
            p_regs->ADCER.BIT.DIAGVAL = (uint8_t)(p_config->diag_method & 0x3);   // 2-bit value;
        }
        p_regs->ADCER.BIT.DIAGM = 1;
    }

    /* SET DOUBLE TRIGGER CHANNEL */
    if (1 == p_regs->ADCSR.BIT.DBLE)
    {
        i = 0;
        tmp_mask = p_config->chan_mask;         // tmp_mask is non-Group/Group A chans

        /* WAIT_LOOP */
        while (tmp_mask >>= 1)                  // determine bit/ch number
        {
            i++;
        }
        p_regs->ADCSR.BIT.DBLANS = i;
    }

    p_regs->ADELCCR.BIT.ELCC = p_config->signal_elc;

    /* ENABLE INTERRUPTS */
    adc_enable_s12adi(unit);
    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        adc_enable_s12gbadi(unit);
        if (1 == p_regs->ADGCTRGR.BIT.GRCE)
        {
            adc_enable_s12gcadi(unit);
        }
    }

    return ADC_SUCCESS;
} /* End of function adc_configure_scan() */


