aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_s12ad_rx/src/targets/rx66t/r_s12ad_rx66t.c
        /* When PGA is enabled, AN007 and AN107 pins should not be subjected to conversion. */
        if ((ADC_PGA_SINGLE_END_INPUT_1 == p_config->signal_path_control[i])
        || (ADC_PGA_SINGLE_END_INPUT_2 == p_config->signal_path_control[i])
        || (ADC_PGA_SINGLE_END_INPUT_3 == p_config->signal_path_control[i])
        || (ADC_PGA_DIFFERENTIAL_INPUT_1 == p_config->signal_path_control[i])
        || (ADC_PGA_DIFFERENTIAL_INPUT_2 == p_config->signal_path_control[i])
        || (ADC_PGA_DIFFERENTIAL_INPUT_3 == p_config->signal_path_control[i]))
        {
            if ((0 != (p_config->chan_mask & ADC_MASK_CH7)) \
            || (0 != (p_config->chan_mask_groupb & ADC_MASK_CH7)) \
            || (0 != (p_config->chan_mask_groupc & ADC_MASK_CH7)))
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }

        /* Should be set an appropriate gain. */
        /* WAIT_LOOP */
        for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
        {
            if ((ADC_GENERAL_PORT_1 == p_config->signal_path_control[i])
            || (ADC_ANALOG_INPUT_1 == p_config->signal_path_control[i])
            || (ADC_ANALOG_INPUT_2 == p_config->signal_path_control[i])
            || (ADC_ANALOG_INPUT_3 == p_config->signal_path_control[i]))
            {
                if (ADC_PGA_GAIN_OFF != p_config->pga_gain[i])
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
            else if ((ADC_PGA_SINGLE_END_INPUT_1 == p_config->signal_path_control[i])
                || (ADC_PGA_SINGLE_END_INPUT_2 == p_config->signal_path_control[i])
                || (ADC_PGA_SINGLE_END_INPUT_3 == p_config->signal_path_control[i]))
            {
                if ((ADC_PGA_GAIN_2_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_2_500 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_3_077 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_3_636 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_4_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_4_444 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_5_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_6_667 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_8_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_10_000 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_13_333 != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_20_000 != p_config->pga_gain[i]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
            else if ((ADC_PGA_DIFFERENTIAL_INPUT_1 == p_config->signal_path_control[i])
                || (ADC_PGA_DIFFERENTIAL_INPUT_2 == p_config->signal_path_control[i])
                || (ADC_PGA_DIFFERENTIAL_INPUT_3 == p_config->signal_path_control[i]))
            {
                if ((ADC_PGA_GAIN_1_500_DIFF != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_4_000_DIFF != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_7_000_DIFF != p_config->pga_gain[i])
                && (ADC_PGA_GAIN_12_333_DIFF != p_config->pga_gain[i]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
        }
    }
    else if (2 == unit)
    {

        /* Unit 2 can not set PGA. */
        if ((ADC_ANALOG_INPUT_1 != p_config->signal_path_control[0])
        || (ADC_ANALOG_INPUT_1 != p_config->signal_path_control[1])
        || (ADC_ANALOG_INPUT_1 != p_config->signal_path_control[2]))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        if ((ADC_PGA_GAIN_OFF != p_config->pga_gain[0])
        || (ADC_PGA_GAIN_OFF != p_config->pga_gain[1])
        || (ADC_PGA_GAIN_OFF != p_config->pga_gain[2]))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    return ADC_SUCCESS;
} /* End of function adc_check_scan_config() */
#endif /* ADC_CFG_PARAM_CHECKING_ENABLE == 1 */


/******************************************************************************
* Function Name: adc_configure_sensors
* Description  : This function set the sensor bits taking into account group
*                inclusion and addition/average mode.
* Arguments    : p_config -
*                   The configuration argument passed to ADC_CMD_ENABLE_CHANS.
* Return Value : none
*******************************************************************************/
static void adc_configure_sensors(adc_ch_cfg_t   *p_config)
{

    /* TEMPERATURE SENSOR */
    if ((p_config->chan_mask & ADC_MASK_TEMP)
    || (p_config->chan_mask_groupb & ADC_MASK_TEMP)
    || (p_config->chan_mask_groupc & ADC_MASK_TEMP))
    {

        /* Waiting time for sensors stabilization. 
           Stabilization time * margin = 200us * 1.1 = 220us  */
        R_BSP_SoftwareDelay(220, BSP_DELAY_MICROSECS);
    }

    /* INTERNAL REFERENCE VOLTAGE SENSOR */
    if ((p_config->chan_mask & ADC_MASK_VOLT)
    || (p_config->chan_mask_groupb & ADC_MASK_VOLT)
    || (p_config->chan_mask_groupc & ADC_MASK_VOLT))
    {
        S12AD2.ADEXICR.BIT.OCSA = 0;
        S12AD2.ADEXICR.BIT.OCSB = 0;
        S12AD2.ADGCEXCR.BIT.OCSC = 0;

        S12AD2.ADVMONCR.BIT.VDE = 1;
        S12AD2.ADVMONO.BIT.VDO = 1;

        if (p_config->chan_mask & ADC_MASK_VOLT)
        {
            S12AD2.ADEXICR.BIT.OCSA = 1;            // select temperature output to GroupA
            S12AD2.ADEXICR.BIT.OCSB = 0;
            S12AD2.ADGCEXCR.BIT.OCSC = 0;
        }
        else if (p_config->chan_mask_groupb & ADC_MASK_VOLT)
        {
            S12AD2.ADEXICR.BIT.OCSA = 0;
            S12AD2.ADEXICR.BIT.OCSB = 1;            // select temperature output to GroupB
            S12AD2.ADGCEXCR.BIT.OCSC = 0;
        }
        else
        {
            S12AD2.ADEXICR.BIT.OCSA = 0;
            S12AD2.ADEXICR.BIT.OCSB = 0;
            S12AD2.ADGCEXCR.BIT.OCSC = 1;           // select temperature output to GroupC
        }

        S12AD2.ADEXICR.BIT.OCSAD = (p_config->add_mask & ADC_MASK_VOLT) ? 1 : 0;

        /* Waiting time for sensors stabilization.
           Stabilization time * margin = 400ns * 1.1 = 440ns
           The minimum wait time of R_BSP_SoftwareDelay is 1 us. */
        R_BSP_SoftwareDelay(1, BSP_DELAY_MICROSECS);
    }

    return;
} /* End of function adc_configure_sensors() */


