aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_s12ad_rx/src/targets/rx66t/r_s12ad_rx66t.c
/******************************************************************************
* Function Name: adc_enable_s12adi
* Description  : This function clears the S12ADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12adi(uint8_t unit)
{
    if (0 == unit)
    {
        IR(S12AD,S12ADI) = 0;            // clear flag
        S12AD.ADCSR.BIT.ADIE = 1;           // enable in peripheral
        if (0 != IPR(S12AD,S12ADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,S12ADI));       // enable in ICU
        }
    }
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12ADI1) = 0;            // clear flag
        S12AD1.ADCSR.BIT.ADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD1,S12ADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,S12ADI1));       // enable in ICU
        }
    }
    else /* Unit2 */
    {
        IR(S12AD2,S12ADI2) = 0;            // clear flag
        S12AD2.ADCSR.BIT.ADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD2,S12ADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,S12ADI2));       // enable in ICU
        }
    }
} /* End of function adc_enable_s12adi() */


/******************************************************************************
* Function Name: adc_enable_s12gbadi
* Description  : This function clears the S12GBADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gbadi(uint8_t unit)
{
    if (0 == unit)
    {
        IR(S12AD,S12GBADI) = 0;            // clear flag
        S12AD.ADCSR.BIT.GBADIE = 1;           // enable in peripheral
        if (0 != IPR(S12AD,S12GBADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,S12GBADI));       // enable in ICU
        }
    }
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12GBADI1) = 0;            // clear flag
        S12AD1.ADCSR.BIT.GBADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD1,S12GBADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,S12GBADI1));       // enable in ICU
        }
    }
    else /* Unit2 */
    {
        IR(S12AD2,S12GBADI2) = 0;            // clear flag
        S12AD2.ADCSR.BIT.GBADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD2,S12GBADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,S12GBADI2));       // enable in ICU
        }
    }
} /* End of function adc_enable_s12gbadi() */


/******************************************************************************
* Function Name: adc_enable_s12gcadi
* Description  : This function clears the S12GCADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gcadi(uint8_t unit)
{
    if (0 == unit)
    {
        IR(S12AD,S12GCADI) = 0;           // clear flag
        S12AD.ADGCTRGR.BIT.GCADIE = 1;           // enable in peripheral
        if (0 != IPR(S12AD,S12GCADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,S12GCADI));       // enable in ICU
        }
    }
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12GCADI1) = 0;            // clear flag
        S12AD1.ADGCTRGR.BIT.GCADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD1,S12GCADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,S12GCADI1));       // enable in ICU
        }
    }
    else /* Unit2 */
    {
        IR(S12AD2,S12GCADI2) = 0;            // clear flag
        S12AD2.ADGCTRGR.BIT.GCADIE = 1;          // enable in peripheral
        if (0 != IPR(S12AD2,S12GCADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,S12GCADI2));       // enable in ICU
        }
    }
} /* End of function adc_enable_s12gcadi() */


/******************************************************************************
* Function Name: adc_close
* Description  : This is implementation of R_ADC_Close().
*                This function ends any scan in progress, disables interrupts,
*                and removes power to the A/D peripheral.
* Arguments    : none
* Return Value : ADC_SUCCESS - Successful
*                ADC_ERR_INVALID_ARG - unit contains an invalid value.
*******************************************************************************/
adc_err_t adc_close(uint8_t const  unit)
{

    /* Get S12AD register address */
    aregs_t     *p_regs = ADC_PRV_GET_REGS_PTR(unit);
    volatile    uint8_t i;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if (unit > 2)
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif

    /* Stop triggers & conversions, and disable peripheral interrupts */
    if (0 == unit)
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD,S12ADI));         // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD,S12GBADI));       // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD,S12GCADI));       // disable interrupts in ICU

        IPR(S12AD,S12ADI) = 0;
        IPR(S12AD,S12GBADI) = 0;
        IPR(S12AD,S12GCADI) = 0;
    }
    else if (1 == unit) /* Unit1 */
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD1,S12ADI1));         // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD1,S12GBADI1));       // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD1,S12GCADI1));       // disable interrupts in ICU

        IPR(S12AD1,S12ADI1) = 0;
        IPR(S12AD1,S12GBADI1) = 0;
        IPR(S12AD1,S12GCADI1) = 0;
    }
    else /* Unit2 */
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD2,S12ADI2));         // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD2,S12GBADI2));       // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD2,S12GCADI2));       // disable interrupts in ICU

        IPR(S12AD2,S12ADI2) = 0;
        IPR(S12AD2,S12GBADI2) = 0;
        IPR(S12AD2,S12GCADI2) = 0;
    }

    /* This program does not disable IPR register of Group interrupt.
     * Because, other peripheral is possible to use same vector Group interrupt. */
    R_BSP_InterruptRequestDisable(VECT(ICU,GROUPBL1));                      // disable group

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    ICU.GENBL1.LONG &= (~g_dcb[unit].cmpi_mask);  // disable group subvector
    ICU.GENBL1.LONG &= (~g_dcb[unit].cmpi_maskb);   // disable group subvector
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    p_regs->ADCMPCR.BIT.CMPAIE = 0;             // disable interrupt in ADC
    if (0 == p_regs->ADCMPCR.BIT.CMPAIE)        // dummy read for waiting until set the value of CMPIE
    {
        R_BSP_NOP();
    }

    p_regs->ADCMPCR.BIT.CMPBIE = 0;             // disable interrupt in ADC
    if (0 == p_regs->ADCMPCR.BIT.CMPBIE)        // dummy read for waiting until set the value of CMPIE
    {
        R_BSP_NOP();
    }

    if (1 == p_regs->ADGSPCR.BIT.PGS)
    {
        p_regs->ADGSPCR.BIT.PGS = 0;
    }

    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.WORD = 0x3F3F;
        if (1 == p_regs->ADGCTRGR.BIT.GRCE)
        {
            p_regs->ADGCTRGR.BIT.TRSC = 0x3F;
            p_regs->ADGCTRGR.BIT.GCADIE = 0;
            p_regs->ADGCTRGR.BIT.GRCE = 0;
        }
        p_regs->ADCSR.BIT.GBADIE = 0;
    }
    else
    {
        p_regs->ADSTRGR.BIT.TRSA = 0x3F;
        p_regs->ADCSR.BIT.ADIE = 0;
    }

